eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаИзменениеРеквизитовКонтрагента/абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаИзменениеРеквизитовКонтрагента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПОНовое</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНННовое</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППНовое</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицоНовое</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяРезидентомНовое</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФНовое</name>
    <type>
      <types>CatalogRef.КлассификаторОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипыКонтрагентов</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипыКонтрагентовНовое</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодОКОНХНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторНаименованиеНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КураторКодНовое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтранаНовое</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Номер_ИСУП_ТТК</name>
    <comment>Код в системе КТТК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВнешнейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяВКадровомМодуле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяВКадровомМодулеНовое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ФизЛицоНовое</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовЗаявкиНаИзменениеРеквизитов/абс_ИзменениеСтатусовЗаявкиНаИзменениеРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовЗаявкиНаИзменениеРеквизитов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов/абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов</name>
  <enumValues>
    <name>ПроверкаНСИ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыКонтрагентов/абсСтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыКонтрагентов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>ЗавершениеОтношений</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереутверждение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СменаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/КлючевыеОперации/КлючевыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлючевыеОперации</name>
  <enumValues>
    <name>ПроведениеДокументаВыпускПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаЗаказПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаЗаказПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаКомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаОприходованиеМатериаловИзПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаОтчетМастераСмены</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаОтчетПроизводстваЗаСмену</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаПоступлениеТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаПриходныйКассовыйОрдер</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаПриходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаРасходныйКассовыйОрдер</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаРасходныйОрдерНаТовары</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаРасчетСебестоимостиВыпуска</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаРеализацияТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаТребованиеНакладная</name>
  </enumValues>
  <enumValues>
    <name>ОбщаяПроизводительностьСистемы</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаПлатежноеПоручениеИсходящее</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаПлатежноеПоручениеВходящее</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаЗакупочныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокументаАбс_СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНовогоКонтрагента_Подготовка_СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНовогоКонтрагента_СогласованиеДЭБ_ПроверкаНСИ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНовогоКонтрагента_СогласованиеДЭБ_Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНовогоКонтрагента_ПроверкаНСИ_Активный</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНовогоКонтрагента_ПроверкаНСИ_Отказ</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКонтрагента_Подготовка_ПроверкаНСИ</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКонтрагента_ПроверкаНСИ_СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКонтрагента_ПроверкаНСИ_Отказ</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКонтрагента_СогласованиеДЭБ_Активный</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеКонтрагента_СогласованиеДЭБ_Отказ</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаДоговораКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаИзменениеРеквизитовКонтрагента</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗаявкаНаИзменениеРеквизитовКонтрагента/ObjectModule.bsl
Процедура ОчиститьРеквизитыПриКопировании(ТекОбъект)
	
	Для Каждого ТекРеквизит из ТекОбъект.Метаданные().Реквизиты Цикл
		ТекОбъект[ТекРеквизит.Имя] = "";
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументВнешнейСистемы = Ложь;
	Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ;
	Если ОбъектКопирования.Контрагент.абс_СтатусКонтрагента  <> Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		Контрагент = "";		                              
	КонецЕсли;
	ОчиститьРеквизитыПриКопировании(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Контрагент.Пустая() Тогда
		Сообщить("Не заполнен контрагент!!!");
		Отказ = Истина;
		//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
		абс_ЗавершитьЗамерПроизводительности();	
		//\\АБС ВСТАВКА №38173 КОНЕЦ
		Возврат;
	КонецЕсли;   	
	
	//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
	Если Отказ Тогда
		абс_ЗавершитьЗамерПроизводительности();
	КонецЕсли;	
	//\\АБС ВСТАВКА №38173 КОНЕЦ	
	
КонецПроцедуры

Функция НайтиБПИзменениеРеквизитов() Экспорт
	
	Возврат абс_БизнесПроцессы.НайтиБизнесПроцессИзмененияРеквизитовКонтрагента(Ссылка);
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Бобылев А.А. 25.10.2017 77204679 
	//НачатьТранзакцию();
	//---------------------------------
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусЗаявкиНаИзменениеПоРегистру(Ссылка);
	
	Если НЕ Статус = СтатусПоРегистру Тогда
		ЗаписатьНовыйСтатус(Статус, ПричинаИзмененияСтатуса);		
	КонецЕсли;	
	
	Если Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ ТОгда
		
		// АБС ИЗМЕНЕНО 4306
		// АБС ИЗМЕНЕНО АБС-Ф 20111117 Заявка на изменение реквизитов контрагентов
		Если (Контрагент.абс_СтатусКонтрагента <> Перечисления.абсСтатусыКонтрагентов.Активный)
			И (Контрагент.абс_СтатусКонтрагента <> Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов)  Тогда
			
			Отказ = Истина;
			Сообщить("Контрагент не является активным !!!");
			//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
			абс_ЗавершитьЗамерПроизводительности();	
			//\\АБС ВСТАВКА №38173 КОНЕЦ			
			Возврат;
			
		КонецЕсли;
		Если Контрагент.абс_СтатусКонтрагента=Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов Тогда
			//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
			абс_ЗавершитьЗамерПроизводительности();	
			//\\АБС ВСТАВКА №38173 КОНЕЦ
			возврат;
		КонецЕсли;			                           
		ТекОбъект = Контрагент.ПолучитьОбъект();
		
		СтруктураИзмененных = ПолучитьСтруктуруИзмененныхРеквизитов();		
		
		ТекОбъект.абс_СтатусКонтрагента 		= Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов;
		ТекОбъект.абс_ПричинаИзмененияСтатуса	= ПолучитьКомментарийИзмененныхРеквизитов(СтруктураИзмененных, Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов);
		//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
		ТекОбъект.мЗамерВремениУжеЗапущенЧерезЗаявкуНаИзменение = Истина;	
		//\\АБС ВСТАВКА №38173 КОНЕЦ
		ТекОбъект.Записать();	
		
	ИначеЕсли 	Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ Тогда
		// АБС ИЗМЕНЕНО 4306
		//Если  Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов ТОгда
		//	Отказ = Истина;
		//	Сообщить("Контрагент не находится в статусе мена реквизитов!!!");
		//	Возврат;
		//КонецЕсли;	
		
		// АБС ИЗМЕНЕНО АБС-Ф 20111117 Заявка на изменение реквизитов контрагентов
		Если  (Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.Активный) И (Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов) ТОгда
			Отказ = Истина;
			Сообщить("Контрагент не является активным !!!");
			//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
			абс_ЗавершитьЗамерПроизводительности();	
			//\\АБС ВСТАВКА №38173 КОНЕЦ			
			Возврат;
		КонецЕсли;		
		
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано 
		// АБС ИЗМЕНЕНО 4306
		// АБС ИЗМЕНЕНО АБС-Ф 20111117 Заявка на изменение реквизитов контрагентов
		и  Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов
		и  Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.Активный   ТОгда
		Отказ = Истина;
		Сообщить("Контрагент не является активным и не находится в статусе на изменение реквизитов!!!");
		//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
		абс_ЗавершитьЗамерПроизводительности();	
		//\\АБС ВСТАВКА №38173 КОНЕЦ		
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано Тогда
		// АБС ИЗМЕНЕНО 4306
		// АБС ИЗМЕНЕНО АБС-Ф 20111117 Заявка на изменение реквизитов контрагентов
		Если Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов   Тогда
			//И Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.Активный   ТОгда
			//	Отказ = Истина;
			Сообщить("Контрагент не находится в статусе Смена Реквизитов !!!");
			//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
			абс_ЗавершитьЗамерПроизводительности();	
			//\\АБС ВСТАВКА №38173 КОНЕЦ			
			Возврат;
		КонецЕсли;
		
		ТекСпрКонтр = Контрагент.ПолучитьОбъект();	
		Для Каждого ТекРекв Из Метаданные().Реквизиты Цикл 			
			Если Найти(ТекРекв.Имя,"Новое")>0 ТОгда
				СтрБезНовое = СтрЗаменить(ТекРекв.Имя,"Новое","");
				Попытка
					ТекСпрКонтр[СтрБезНовое] = ЭтотОбъект[ТекРекв.Имя];
				Исключение
				КонецПопытки; 				
			КонецЕсли;					
		КонецЦикла;
		//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
		ТекСпрКонтр.мЗамерВремениУжеЗапущенЧерезЗаявкуНаИзменение = Истина;	
		//\\АБС ВСТАВКА №38173 КОНЕЦ

		
		Попытка
			// Статус смены реквизитов пишем для галочки задним числом 4306
			ТекДата = абс_СерверныеФункции.ПолучитьДатуСервера();
			
			// АБС ИЗМЕНЕНО АБС-Ф 20111117 Заявка на изменение реквизитов контрагентов
			СтруктураИзмененных = ПолучитьСтруктуруИзмененныхРеквизитов();		
			//ТекСпрКонтр.ЗаписатьНовыйСтатус(Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов, 
			//	ПолучитьКомментарийИзмененныхРеквизитов(СтруктураИзмененных, Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов) , ТекДата - 1);
			//	
			// Запишем статус Активный	
			ТекСпрКонтр.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Активный;
			ТекСпрКонтр.абс_ПричинаИзмененияСтатуса = ПолучитьКомментарийИзмененныхРеквизитов(СтруктураИзмененных, Перечисления.абсСтатусыКонтрагентов.Активный);
			
			//ТекСпрКонтр.ЗаписатьНовыйСтатус(Перечисления.абсСтатусыКонтрагентов.Активный, 
			//	ПолучитьКомментарийИзмененныхРеквизитов(СтруктураИзмененных, Перечисления.абсСтатусыКонтрагентов.Активный) , ТекДата);
			
			//ТекСпрКонтр.абс_ПричинаИзмененияСтатуса = "";
			//	
			ТекСпрКонтр.Записать();
// +++ввв 27.09.2016 г.
			Если ЭтотОбъект.ИНН<>ЭтотОбъект.ИНННовое ИЛИ ЭтотОбъект.КПП<>ЭтотОбъект.КППНовое Тогда
				йСтатусОтвета=Неопределено;	
				йСтрОшибки=ОбщегоНазначенияСервер.ПроверкаКонтрагентаПоИННиКППнаИФНС(ЭтотОбъект.ИНННовое,ЭтотОбъект.КППНовое,йСтатусОтвета);
				ОбщегоНазначенияСервер.ОбновитьСтатусВИФНСКонтрагента(ТекСпрКонтр.Ссылка,Неопределено,йСтатусОтвета,ЭтотОбъект.абс_Инициатор);
			КонецЕсли;
// ---ввв 27.09.2016 г.
		Исключение
			//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
			абс_ЗавершитьЗамерПроизводительности(1);	
			//\\АБС ВСТАВКА №38173 КОНЕЦ			
			ttk_ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
		КонецПопытки;
		
	ИначеЕсли Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ  
		// АБС ИЗМЕНЕНО 4306  		
		//и  Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов   ТОгда
		и  Контрагент.абс_СтатусКонтрагента <>Перечисления.абсСтатусыКонтрагентов.Активный ТОгда 	
		
		ТекОбъект = Контрагент.ПолучитьОбъект();
		//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
		ТекОбъект.мЗамерВремениУжеЗапущенЧерезЗаявкуНаИзменение = Истина;
		//\\АБС ВСТАВКА №38173 КОНЕЦ 
		СтруктураИзмененных = ПолучитьСтруктуруИзмененныхРеквизитов();		
		ТекОбъект.абс_СтатусКонтрагента 		= Перечисления.абсСтатусыКонтрагентов.Активный;
		ТекОбъект.абс_ПричинаИзмененияСтатуса	= ПолучитьКомментарийИзмененныхРеквизитов(СтруктураИзмененных, Перечисления.абсСтатусыКонтрагентов.Отказ); 		
		ТекОбъект.Записать();
		
	КонецЕсли;
	
	
	// Получим БП изменения реквизитов,
	// если БП запущен, то значит контрагент находится в изменении реквизитов.
	
	
	// АБС Изменение Родин Отключение бизнес-процессов 110314	
	СогласованиеБезБП = глЗначениеПеременной("абс_СогласованиеБезБП");
	Если Не СогласованиеБезБП Тогда
		БПИзменениеРеквизитов = НайтиБПИзменениеРеквизитов();		
		Если НЕ ЗначениеЗаполнено(БПИзменениеРеквизитов) И Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ Тогда
			абс_БизнесПроцессы.ЗапуститьБПИзмененияРеквизитовКонтрагента(Ссылка);
		КонецЕсли; 
		
		// Попробуем закрыть задачу переутверждения
		ЗадачаИзменениеРеквизитов = ПолучитьЗадачуПоИзменениюРеквизитовКонтрагента();
		
		Если ЗначениеЗаполнено(ЗадачаИзменениеРеквизитов) Тогда
			Если Не ЗадачаИзменениеРеквизитов.Выполнена Тогда
				ЗадачаОбъект = ЗадачаИзменениеРеквизитов.ПолучитьОбъект();	
				ЗадачаОбъект.ВыполнитьЗадачу();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	// АБС Изменение Родин Отключение бизнес-процессов 110314
	
	//Бобылев А.А. 25.10.2017 77204679 
	//ЗафиксироватьТранзакцию();
	//------------------------------------
	
	//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
	Если Отказ Тогда
		абс_ЗавершитьЗамерПроизводительности();
	КонецЕсли;	
	//\\АБС ВСТАВКА №38173 КОНЕЦ	
	
КонецПроцедуры

Функция ПолучитьЗадачуПоИзменениюРеквизитовКонтрагента() Экспорт
	
	БП = НайтиБПИзменениеРеквизитов();
	
	Если БП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СпТочек = Новый Массив;
	
	Если Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсИзменениеРеквизитовКонтрагентов.ТочкиМаршрута.ДействиеСогласованиеДЭБ);
		
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.СогласованиеДЭБ Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсИзменениеРеквизитовКонтрагентов.ТочкиМаршрута.ДействиеПроверкаДФМ);
		
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсИзменениеРеквизитовКонтрагентов.ТочкиМаршрута.ДействиеСогласованиеДЭБ);
		
	ИначеЕсли Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ Тогда
		
		СпТочек.Добавить(БизнесПроцессы.абсИзменениеРеквизитовКонтрагентов.ТочкиМаршрута.ДействиеПроверкаДФМ);
		СпТочек.Добавить(БизнесПроцессы.абсИзменениеРеквизитовКонтрагентов.ТочкиМаршрута.ДействиеСогласованиеДЭБ);
		
	КонецЕсли;
	
	Возврат абс_БизнесПроцессы.НайтиЗадачуИзмененияРеквизитов(БП, СпТочек);
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Согласовано ТОгда
		Сообщить("Запрещено отменять с проведения согласованные документы!!!");	
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, Комментарий = Неопределено) Экспорт
	
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовЗаявкиНаИзменениеРеквизитов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Заявка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();
	
	Запись.Заявка				= Ссылка;
	Запись.Пользователь 		= ТекПользователь;	
	Запись.СтатусЗаявки			= НовыйСтатус;
	
	Запись.Комментарий 			= Комментарий;
	
	//ОтветственныйСотрудник = абс_БизнесПроцессы.ПолучитьСотрудникаПользователя(ТекПользователь);
	//
	//Если НЕ ОтветственныйСотрудник = Неопределено Тогда
	//	Запись.ДолжностьОтветственного	= ОтветственныйСотрудник.Должность;
	//КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
	абс_НачатьЗамерПроизводительности();
	//\\АБС ВСТАВКА №38173 КОНЕЦ 
	
	ТекДата = абс_СерверныеФункции.ПолучитьДатуСервера();
	
	Если ЭтоНовый() Тогда
		Дата = ТекДата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСозданияЗаявки) Тогда
		ДатаСозданияЗаявки = ТекДата;
	КонецЕсли;
	
	// АБС ВСТАВКА Фролов 13096
	Если НеЯвляетсяРезидентомНовое И абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия Тогда
		
		абс_СтранаНовое = Справочники.КлассификаторСтранМира.ПустаяСсылка();
		
	ИначеЕсли НЕ НеЯвляетсяРезидентомНовое И НЕ абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия Тогда
		
		//абс_СтранаНовое = Справочники.КлассификаторСтранМира.Россия;
		
	КонецЕсли;
	// АБС ВСТАВКА Фролов 13096 КОНЕЦ
	
	//АБС ВСТАВКА 13096/12511 НАЧАЛО
	Если Ссылка.Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.ПроверкаНСИ И 
		НЕ Статус = Перечисления.абс_СтатусыЗаявокНаИзменениеРеквизитовКонтрагентов.Отказ Тогда
		
		Если НЕ ЗначениеЗаполнено(абс_СтранаНовое) и НеЯвляетсяРезидентомНовое Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Реквизит ""Страна"" не заполнен.", Отказ);
		КонецЕсли;
		
	КонецЕсли;	
	//\\АБС ВСТАВКА 13096/12511 КОНЕЦ		
	
	//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
	Если Отказ Тогда
		абс_ЗавершитьЗамерПроизводительности();
	КонецЕсли;	
	//\\АБС ВСТАВКА №38173 КОНЕЦ	
	
КонецПроцедуры

Функция ПолучитьСтруктуруИзмененныхРеквизитов() Экспорт
	
	СтруктураИзмененныхРеквизитов = Новый Структура;
	
	ТекРеквизиты = Метаданные.Документы.абс_ЗаявкаНаИзменениеРеквизитовКонтрагента.Реквизиты;
	
	Для Каждого ТекРеквизит из  ТекРеквизиты Цикл
		
		ИмяРеквизита = ТекРеквизит.Имя;
		
		Если НЕ Найти(ИмяРеквизита, "Новое") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизитаСтарое = СтрЗаменить(ИмяРеквизита, "Новое", ""); 
		
		РеквизитИзменен = Ложь;
		
		Попытка
			Если НЕ ЭтотОбъект[ИмяРеквизита] = ЭтотОбъект[СтрЗаменить(ИмяРеквизита, "Новое", "")] Тогда
				РеквизитИзменен = Истина;
			КонецЕсли;
			
			Если РеквизитИзменен Тогда
				СтруктураИзмененныхРеквизитов.Вставить(ИмяРеквизитаСтарое);
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат СтруктураИзмененныхРеквизитов;
	
КонецФункции

Функция ПолучитьКомментарийИзмененныхРеквизитов(СтруктураИзмененных, СтатусИзменения)
	
	// АБС ВСТАВКА 6920
	Если СтатусИзменения = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		
		ТекстКомментария = ПричинаИзмененияСтатуса + ". " + "Заявка ЕИСУП: " + Номер;
		
		Возврат ТекстКомментария;
		
	КонецЕсли;
	//\\ АБС ВСТАВКА 6920 КОНЕЦ	
	
	Если СтатусИзменения = Перечисления.абсСтатусыКонтрагентов.СменаРеквизитов Тогда
		
		ТекстКомментария = "Запрос на изменение реквизитов, " + СокрЛП(Ссылка) + ": ";
	ИначеЕсли СтатусИзменения = Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		
		ТекстКомментария = "Изменены реквизиты, " + СокрЛП(Ссылка) + ": ";
	ИначеЕсли СтатусИзменения = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		
		ТекстКомментария = "Отклонено изменение реквизитов, " + СокрЛП(Ссылка) + ": ";
	КонецЕсли;	
	
	РеквизитыЗаявки = ЭтотОбъект.Метаданные().Реквизиты;
	
	ЭтоПервыйРеквизит = Истина;
	
	Для Каждого ИзмРеквизит Из СтруктураИзмененных Цикл
		
		ТекстКомментария = ТекстКомментария + ?(НЕ ЭтоПервыйРеквизит, ", ", "") + """" + РеквизитыЗаявки[ИзмРеквизит.Ключ].Синоним + """";
		
	КонецЦикла;
	
	Если СтатусИзменения = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		
		ТекстКомментария = ТекстКомментария + " по причине: """ + ПричинаИзмененияСтатуса + """";
		
	КонецЕсли;
	
	Возврат ТекстКомментария;
	
КонецФункции

//АБС ВСТАВКА №38173 НАЧАЛО «29 января 2014 г.», Пополитов
Процедура абс_НачатьЗамерПроизводительности(ЭлементЗаписан = Ложь) Экспорт   	
	
	Если ОбменДанными.Загрузка
		или Статус = Ссылка.Статус Тогда  		
		Возврат;  		
	КонецЕсли;
	
	ОценкаПроизводительностиКлиентСервер.абс_НачатьЗамерВремени(абс_ОпределитьКлючевуюОперацию(),абс_ОпределитьДополнительныеПараметры(ЭлементЗаписан));
	
КонецПроцедуры	

Процедура абс_ЗавершитьЗамерПроизводительности(КодОшибки = 0) Экспорт
	
	Если ОбменДанными.Загрузка Тогда  		
		Возврат;
	КонецЕсли;	
	
	СоответствиеОшибок = новый Соответствие;
	СоответствиеОшибок.Вставить(0,"Не пройден контроль записи ""Заявка на изменение реквизитов контрагента"".");
	СоответствиеОшибок.Вставить(1,"Ошибка при записи ""Заявка на изменение реквизитов контрагента"".");
	СоответствиеОшибок.Вставить(2,"Запись ""Заявка на изменение реквизитов контрагента"" прошла успешно.");
		
	ОценкаПроизводительностиКлиентСервер.абс_ЗакончитьЗамерВремени(абс_ОпределитьКлючевуюОперацию(),СоответствиеОшибок.Получить(КодОшибки));
	
КонецПроцедуры

Функция абс_ОпределитьКлючевуюОперацию()
		
	Возврат Перечисления.КлючевыеОперации.ЗаявкаНаИзменениеРеквизитовКонтрагента;
	
КонецФункции

Функция абс_ОпределитьДополнительныеПараметры(ЭлементЗаписан)
	
	Возврат "Старый статус «"+СокрЛП(Ссылка.Статус)+"», новый статус «"+СокрЛП(Статус)+"»";
	
КонецФункции	
//\\АБС ВСТАВКА №38173 КОНЕЦ
